results/report/statistics.json
{
  "02_Login" : {
    "transaction" : "02_Login",
    "sampleCount" : 20,
    "errorCount" : 20,
    "errorPct" : 100.0,
    "meanResTime" : 3.85,
    "medianResTime" : 4.0,
    "minResTime" : 2.0,
    "maxResTime" : 7.0,
    "pct1ResTime" : 5.0,
    "pct2ResTime" : 6.899999999999999,
    "pct3ResTime" : 7.0,
    "throughput" : 2.1247211303516416,
    "receivedKBytesPerSec" : 0.7282979655795176,
    "sentKBytesPerSec" : 0.37348613619462445
  },
  "10_GetBudgets" : {
    "transaction" : "10_GetBudgets",
    "sampleCount" : 20,
    "errorCount" : 20,
    "errorPct" : 100.0,
    "meanResTime" : 1.7000000000000002,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 5.0,
    "pct1ResTime" : 3.900000000000002,
    "pct2ResTime" : 4.949999999999999,
    "pct3ResTime" : 5.0,
    "throughput" : 2.1321961620469083,
    "receivedKBytesPerSec" : 0.7308602078891258,
    "sentKBytesPerSec" : 0.40395122601279315
  },
  "03_Dashboard" : {
    "transaction" : "03_Dashboard",
    "sampleCount" : 20,
    "errorCount" : 20,
    "errorPct" : 100.0,
    "meanResTime" : 1.9000000000000001,
    "medianResTime" : 2.0,
    "minResTime" : 0.0,
    "maxResTime" : 5.0,
    "pct1ResTime" : 4.800000000000004,
    "pct2ResTime" : 5.0,
    "pct3ResTime" : 5.0,
    "throughput" : 2.1256244021681368,
    "receivedKBytesPerSec" : 0.7286075831650547,
    "sentKBytesPerSec" : 0.37987232968434476
  },
  "07_GetCurrencies" : {
    "transaction" : "07_GetCurrencies",
    "sampleCount" : 20,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 4.749999999999999,
    "medianResTime" : 4.0,
    "minResTime" : 2.0,
    "maxResTime" : 15.0,
    "pct1ResTime" : 6.900000000000002,
    "pct2ResTime" : 14.599999999999994,
    "pct3ResTime" : 15.0,
    "throughput" : 2.1260763261401086,
    "receivedKBytesPerSec" : 1.1274018018496863,
    "sentKBytesPerSec" : 0.34673315084511536
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 200,
    "errorCount" : 160,
    "errorPct" : 80.0,
    "meanResTime" : 3.269999999999999,
    "medianResTime" : 2.0,
    "minResTime" : 0.0,
    "maxResTime" : 27.0,
    "pct1ResTime" : 6.0,
    "pct2ResTime" : 7.0,
    "pct3ResTime" : 25.8900000000001,
    "throughput" : 14.265335235378032,
    "receivedKBytesPerSec" : 5.231087286019972,
    "sentKBytesPerSec" : 2.56608862339515
  },
  "09_GetNotifications" : {
    "transaction" : "09_GetNotifications",
    "sampleCount" : 20,
    "errorCount" : 20,
    "errorPct" : 100.0,
    "meanResTime" : 1.6500000000000004,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 6.0,
    "pct1ResTime" : 3.900000000000002,
    "pct2ResTime" : 5.899999999999999,
    "pct3ResTime" : 6.0,
    "throughput" : 2.1319688732544506,
    "receivedKBytesPerSec" : 0.7307822993284298,
    "sentKBytesPerSec" : 0.3893341594712717
  },
  "01_Register" : {
    "transaction" : "01_Register",
    "sampleCount" : 20,
    "errorCount" : 20,
    "errorPct" : 100.0,
    "meanResTime" : 7.1499999999999995,
    "medianResTime" : 6.0,
    "minResTime" : 4.0,
    "maxResTime" : 27.0,
    "pct1ResTime" : 11.600000000000009,
    "pct2ResTime" : 26.24999999999999,
    "pct3ResTime" : 27.0,
    "throughput" : 2.118868524208073,
    "receivedKBytesPerSec" : 0.7262918476533531,
    "sentKBytesPerSec" : 0.37866498040046614
  },
  "08_GetNews" : {
    "transaction" : "08_GetNews",
    "sampleCount" : 20,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 6.199999999999999,
    "medianResTime" : 4.5,
    "minResTime" : 3.0,
    "maxResTime" : 26.0,
    "pct1ResTime" : 14.400000000000013,
    "pct2ResTime" : 25.449999999999992,
    "pct3ResTime" : 26.0,
    "throughput" : 2.127206977238885,
    "receivedKBytesPerSec" : 0.8392496277387791,
    "sentKBytesPerSec" : 0.3344534407572857
  },
  "04_AddExpense" : {
    "transaction" : "04_AddExpense",
    "sampleCount" : 20,
    "errorCount" : 20,
    "errorPct" : 100.0,
    "meanResTime" : 1.7,
    "medianResTime" : 1.5,
    "minResTime" : 0.0,
    "maxResTime" : 5.0,
    "pct1ResTime" : 3.900000000000002,
    "pct2ResTime" : 4.949999999999999,
    "pct3ResTime" : 5.0,
    "throughput" : 2.1253985122210413,
    "receivedKBytesPerSec" : 0.7285301540913921,
    "sentKBytesPerSec" : 0.42549481934112643
  },
  "05_GetExpenses" : {
    "transaction" : "05_GetExpenses",
    "sampleCount" : 20,
    "errorCount" : 20,
    "errorPct" : 100.0,
    "meanResTime" : 1.85,
    "medianResTime" : 2.0,
    "minResTime" : 1.0,
    "maxResTime" : 5.0,
    "pct1ResTime" : 3.8000000000000043,
    "pct2ResTime" : 4.949999999999999,
    "pct3ResTime" : 5.0,
    "throughput" : 2.1258503401360547,
    "receivedKBytesPerSec" : 0.7286850286989797,
    "sentKBytesPerSec" : 0.4110530931122449
  },
  "06_GetCategories" : {
    "transaction" : "06_GetCategories",
    "sampleCount" : 20,
    "errorCount" : 20,
    "errorPct" : 100.0,
    "meanResTime" : 1.9499999999999997,
    "medianResTime" : 2.0,
    "minResTime" : 1.0,
    "maxResTime" : 4.0,
    "pct1ResTime" : 3.900000000000002,
    "pct2ResTime" : 4.0,
    "pct3ResTime" : 4.0,
    "throughput" : 2.1256244021681368,
    "receivedKBytesPerSec" : 0.7286075831650547,
    "sentKBytesPerSec" : 0.38194813476458706
  }
}